(function ($, mywp, d3) {
    mywp.setAdaption(19.2);


    $(function () {


        /*高度*/
        mywp.fullScreen();

        /*子菜单收缩呈现*/
        var show = {s:true};
        function subToggleShow(show) {
            return function () {
                console.log(show)
                if (show.s) {
                    $('.sub-nav').animate({marginLeft: 0}, 1000);
                    $('.myinf').animate({left: '-3.5rem'}, 1000);
                    $('.tmp2').animate({width: '0'}, 1100);
                } else {
                    $('.sub-nav').animate({marginLeft: '-3.5rem'}, 1000);
                    $('.myinf').animate({left: '0'}, 1000);
                    $('.tmp2').animate({width: '4.3rem'}, 1000);
                }
                show.s = !show.s;
            }
        }
        $('#subToggle').on('click', subToggleShow(show));
        $('#subToggle2').on('click', subToggleShow(show));

        /*信息点生成,从左到右，上到下*/
        var dots = [
            {
                x: '3.25',
                y: '0.16',
                inf:[
                    ['负载类型：','照明、天车'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '0.50',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车1'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '0.77',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车2'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '1.1',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车3'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '4.94',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车4'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '5.22',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车5'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '10.66',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车6'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '10.86',
                y: '2.12',
                inf:[
                    ['负载类型：','照明、天车6'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '10.05',
                y: '1.78',
                inf:[
                    ['负载类型：','照明、天车6'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '10.27',
                y: '1.78',
                inf:[
                    ['负载类型：','照明、天车6'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '10.46',
                y: '1.78',
                inf:[
                    ['负载类型：','照明、天车6'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.65',
                y: '1.78',
                inf:[
                    ['负载类型：','照明、天车6'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '0.64',
                y: '2.66',
                inf:[
                    ['负载类型：','照明、天车61'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '5.09',
                y: '2.53',
                inf:[
                    ['负载类型：','照明、天车6c'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },
            {
                x: '10.86',
                y: '2.35',
                inf:[
                    ['负载类型：','照明、天车6q'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.86',
                y: '3.50',
                inf:[
                    ['负载类型：','照明、天车6q'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.86',
                y: '4.96',
                inf:[
                    ['负载类型：','照明、天车6q'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.86',
                y: '5.92',
                inf:[
                    ['负载类型：','照明、天车6q'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '0.45',
                y: '7.10',
                inf:[
                    ['负载类型：','照明、天车6qx'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '0.45',
                y: '7.34',
                inf:[
                    ['负载类型：','照明、天车6qg'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '0.45',
                y: '7.56',
                inf:[
                    ['负载类型：','照明、天车6qw'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '2.52',
                y: '7.78',
                inf:[
                    ['负载类型：','照明、天车6qw'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '3.8',
                y: '7.78',
                inf:[
                    ['负载类型：','照明、天车6qw'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '9.71',
                y: '7.78',
                inf:[
                    ['负载类型：','照明、天车6qw4'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.2',
                y: '7.78',
                inf:[
                    ['负载类型：','照明、天车6qw3'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.66',
                y: '7.78',
                inf:[
                    ['负载类型：','照明、天车6qw2'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            },{
                x: '10.85',
                y: '7.78',
                inf:[
                    ['负载类型：','照明、天车6qw1'],
                    ['配电总容量：','9999 kVA'],
                    ['实时功率：','9999 kW'],
                    ['实时电压：<br>(UA/UB/UC）','320.00V、319.24V、321.01V'],
                    ['实时电流：<br>(lA/lB/lC)','10A/9.9A/11.0A'],
                    ['频         率：','50.12Hz'],
                    ['功率因数：','0.92'],
                    ['日累计耗电量：','9999.999 kWh92'],
                    ['日累计耗电量：','9999.999 kWh92']
                ]
            }


        ];
        mywp.dot(dots);
        document.addEventListener('click',function () {
            $('.mywp-modal2').remove();
        })

    })

})(jQuery, mywp, d3)